## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:99" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:99" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:3a561af0315000edbe703a7c6504e46a2487791accdb8f6ba6673e95b080ad81" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:565cd9f0b82d771c76ee86f36d98d335ab7e4a59d14451b0ae4804022f4c1734"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 99 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "1e7a0f68fac6fcb2bb33ec96d2947868-6" -> "904a8c51cee6884bf43de42fe432012c"
        id                     = "graphql.904a8c51cee6884bf43de42fe432012c.zip"
        tags                   = {}
      ~ version_id             = "EsK4U4RExkDyj5fE0JcdFeoDEuoxdq.k" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/processValidationJson.001934362155a5aba63e5809098348b0.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b65238d2e7ce637461c8e3bcd74b478f-5" -> "36a8613f29b8ad4b4989005f5906827f"
      ~ id                     = "processValidationJson.001934362155a5aba63e5809098348b0.zip" -> (known after apply)
      ~ key                    = "processValidationJson.001934362155a5aba63e5809098348b0.zip" -> "processValidationJson.36a8613f29b8ad4b4989005f5906827f.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "001934362155a5aba63e5809098348b0" -> "36a8613f29b8ad4b4989005f5906827f"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "wFDwSTflHN7FlHNR3JakKdXNtuHWit2v" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.2d93eabce02b91c6211acaa5e02fadb0.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "82b0330f843ace5dbafcd6a52da60cff-4" -> "d8c9cad1cbdc45f0b42957b2c2fe701d"
      ~ id                     = "python.2d93eabce02b91c6211acaa5e02fadb0.zip" -> (known after apply)
      ~ key                    = "python.2d93eabce02b91c6211acaa5e02fadb0.zip" -> "python.d8c9cad1cbdc45f0b42957b2c2fe701d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "2d93eabce02b91c6211acaa5e02fadb0" -> "d8c9cad1cbdc45f0b42957b2c2fe701d"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "mTmSwQ6dzbUoIsN8xs7pcZpw556g2QBu" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "70f426ce65463e76fe25617ffe68aa74" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/200.html"
      ~ source_hash            = "70f426ce65463e76fe25617ffe68aa74" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "q4weRHVLqzClTjTc3iVWo5Hm9Z4imvtC" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "43c963dd73f6f8227983295f72d02e5c" -> "60867b05c87877a1b51a4b98c9a37c68"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "43c963dd73f6f8227983295f72d02e5c" -> "60867b05c87877a1b51a4b98c9a37c68"
        tags                   = {}
      ~ version_id             = "Ufqp17d5dEOuk9ySKP4Q4nW0gTYDtpCw" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "be23d9c413b86f93b153373bebc5a9a4" -> "9523f2185ba82b988bbd2521fefab528"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "be23d9c413b86f93b153373bebc5a9a4" -> "9523f2185ba82b988bbd2521fefab528"
        tags                   = {}
      ~ version_id             = "rJnDFjgnPJZ368YwGg0em8xcc4hiz3Wn" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "70f426ce65463e76fe25617ffe68aa74" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/index.html"
      ~ source_hash            = "70f426ce65463e76fe25617ffe68aa74" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = ".WOYApBvJCZzEYcPxbEpdSaOoD0Ofh1J" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.6ecdd262.js"] will be destroyed
  # (because key ["static/js/app.6ecdd262.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.6ecdd262.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "e85b048331adaa8bf34a986be5dc961d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.6ecdd262.js" -> null
-       key                    = "dist/static/js/app.6ecdd262.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.6ecdd262.js" -> null
-       source_hash            = "e85b048331adaa8bf34a986be5dc961d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "qqu1IBiE6BLBrp6bIVJYHMoQih5FPlTD" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.6ecdd262.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.6ecdd262.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.6ecdd262.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.6ecdd262.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.6ecdd262.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.6ecdd262.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "WQJbbZNGdi6WKotCm7RdCf.bYkQJ7RKs" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-17T02:49:23.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:66" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:66/invocations" -> (known after apply)
      ~ s3_key                         = "python.2d93eabce02b91c6211acaa5e02fadb0.zip" -> "python.d8c9cad1cbdc45f0b42957b2c2fe701d.zip"
        tags                           = {}
      ~ version                        = "66" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "2fd2f739dd0c21b77755ad59cf9c87cf72524fa7" -> "4daca84409743389bd51232242da7bc443c36834"
              ~ "DD_TAGS"                      = "git.commit.sha:2fd2f739dd0c21b77755ad59cf9c87cf72524fa7,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:4daca84409743389bd51232242da7bc443c36834,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "2fd2f739dd0c21b77755ad59cf9c87cf72524fa7" -> "4daca84409743389bd51232242da7bc443c36834"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "66" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:114" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:114/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "114" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "2fd2f739dd0c21b77755ad59cf9c87cf72524fa7" -> "4daca84409743389bd51232242da7bc443c36834"
              ~ "DD_TAGS"                            = "git.commit.sha:2fd2f739dd0c21b77755ad59cf9c87cf72524fa7,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:4daca84409743389bd51232242da7bc443c36834,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "2fd2f739dd0c21b77755ad59cf9c87cf72524fa7" -> "4daca84409743389bd51232242da7bc443c36834"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "114" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::357150818708:policy/cpfreporter-processValidationJson-inline"
        name      = "cpfreporter-processValidationJson-inline"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "s3:HeadObject",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::cpfreporter-reportingdata-357150818708-us-west-2/uploads/*/*/*/*/*.json"
                        Sid      = "AllowDownloadAndDeleteJsonObjects"
                    },
-                   {
-                       Action   = "kms:Decrypt"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb"
-                       Sid      = "DecryptPostgresSecret"
                    },
-                   {
-                       Action   = [
-                           "ssm:GetParameters",
-                           "ssm:GetParameter",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:ssm:us-west-2:357150818708:parameter/cpfreporter/postgres/master_password"
-                       Sid      = "GetPostgresSecret"
                    },
-                   {
-                       Action   = "rds-db:connect"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:rds-db:us-west-2:357150818708:dbuser:cluster-SW5YR46V2LWC4ACK7BIYJPMPBM/postgres"
-                       Sid      = "PostgresIAMAuth"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_iam_policy.vpc[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "aws_iam_policy" "vpc" {
-       arn       = "arn:aws:iam::357150818708:policy/cpfreporter-processValidationJson-vpc" -> null
-       id        = "arn:aws:iam::357150818708:policy/cpfreporter-processValidationJson-vpc" -> null
-       name      = "cpfreporter-processValidationJson-vpc" -> null
-       path      = "/" -> null
-       policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "ec2:CreateNetworkInterface",
-                           "ec2:DescribeNetworkInterfaces",
-                           "ec2:DeleteNetworkInterface",
-                           "ec2:AssignPrivateIpAddresses",
-                           "ec2:UnassignPrivateIpAddresses",
                        ]
-                       Effect   = "Allow"
-                       Resource = "*"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       policy_id = "ANPAVGJ6ZAGKO5TWZ4FYS" -> null
-       tags      = {} -> null
-       tags_all  = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
    }

  # module.lambda_function-processValidationJson.aws_iam_role_policy_attachment.vpc[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "aws_iam_role_policy_attachment" "vpc" {
-       id         = "cpfreporter-processValidationJson-20240417005044048600000001" -> null
-       policy_arn = "arn:aws:iam::357150818708:policy/cpfreporter-processValidationJson-vpc" -> null
-       role       = "cpfreporter-processValidationJson" -> null
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ last_modified                  = "2024-04-17T02:49:10.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:22" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:22/invocations" -> (known after apply)
      ~ s3_key                         = "processValidationJson.001934362155a5aba63e5809098348b0.zip" -> "processValidationJson.36a8613f29b8ad4b4989005f5906827f.zip"
        tags                           = {}
      ~ version                        = "22" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
-               "DATABASE_SECRET_SOURCE"             = "ssm" -> null
-               "DATABASE_SECRET_SSM_PARAMETER_PATH" = "/cpfreporter/postgres/master_password" -> null
-               "DATABASE_URL"                       = (sensitive value) -> null
              ~ "DD_COMMIT_SHA"                      = "2fd2f739dd0c21b77755ad59cf9c87cf72524fa7" -> "4daca84409743389bd51232242da7bc443c36834"
              ~ "DD_TAGS"                            = "git.commit.sha:2fd2f739dd0c21b77755ad59cf9c87cf72524fa7,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:4daca84409743389bd51232242da7bc443c36834,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "2fd2f739dd0c21b77755ad59cf9c87cf72524fa7" -> "4daca84409743389bd51232242da7bc443c36834"
                # (13 unchanged elements hidden)
            }
        }

-       vpc_config {
-           ipv6_allowed_for_dual_stack = false -> null
-           security_group_ids          = [
-               "sg-088d54ce85f679ac1",
-               "sg-0ac4f2c8cfc0c58bc",
            ] -> null
-           subnet_ids                  = (sensitive value) -> null
-           vpc_id                      = "vpc-0c694e04b728322ce" -> null
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "22" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 8 to add, 10 to change, 10 to destroy.
```

</details>

*Pusher: @laurelkorwin, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8716043410)*